<a href="https://colab.research.google.com/github/ebythomas23/Employee_Turnover_Prediction/blob/main/notebooks/01_end_to_end.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

IMPORT DATA

In [87]:
import pandas as pd

In [88]:
employee_data = pd.read_csv('/Users/ebythomas/Documents/GitHub/Employee_Turnover_Prediction/Dataset/HR.csv')

lets check the data

In [89]:
employee_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [90]:
employee_data.describe()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

In [91]:
employee_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   left                   14999 non-null  int64
 7   promotion_last_5years  14999 non-null  int64
 8   sales                  14999 non-null  object
 9   salary                 14999 non-null  object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

8 columns are numeric and we have 2 categorical columns . there is no missing values . looks like the data is pretty clean. In left column if the its 0 represent the emplyees who havent left .

In [92]:
employee_data.shape

(14999, 10)

Split the data into test and train set, adn keep keep test set aside . we will check into data using the training data

In [93]:
X = employee_data.drop(columns='left', inplace=False)
y = employee_data['left'].copy()

In [94]:
from sklearn.model_selection import train_test_split



X_train, y_train , X_test, y_test = train_test_split(X,y,test_size=0.2,random_state=42)

Data preprocessing

first lets handle categorical data

In [95]:
sales_data = X_train[["sales"]]
sales_data.head()

            sales
9838  product_mng
7689    technical
6557        RandD
6872   accounting
820     technical

In [96]:
sales_data.value_counts()

sales
sales          3317
technical      2173
support        1766
IT              976
product_mng     744
marketing       669
accounting      632
RandD           620
hr              582
management      520
Name: count, dtype: int64

we will do one -hot encoding

In [121]:
from sklearn.preprocessing import OneHotEncoder

cat_encoder = OneHotEncoder(sparse_output=False)
sales_data_1hot = cat_encoder.fit_transform(sales_data)

In [122]:
sales_data_1hot

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 1.],
       [0., 1., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 1., 0., 0.],
       [0., 0., 0., ..., 1., 0., 0.]], shape=(11999, 10))

In [107]:
cat_encoder.categories_

[array(['IT', 'RandD', 'accounting', 'hr', 'management', 'marketing',
        'product_mng', 'sales', 'support', 'technical'], dtype=object)]

In [125]:
sales_data_1hot_output =pd.DataFrame(sales_data_1hot
                                     ,index=sales_data.index)

In [116]:
sales_data_1hot_output.head()

                                                  sales
9838  <Compressed Sparse Row sparse matrix of dtype ...
7689  <Compressed Sparse Row sparse matrix of dtype ...
6557  <Compressed Sparse Row sparse matrix of dtype ...
6872  <Compressed Sparse Row sparse matrix of dtype ...
820   <Compressed Sparse Row sparse matrix of dtype ...

sales column

In [100]:
salary_data = X_train[["salary"]]
salary_data.head()

      salary
9838     low
7689    high
6557  medium
6872  medium
820      low

we will do ordinal as we have 3 category low, medium and high

In [101]:
from sklearn.preprocessing import OrdinalEncoder
ordinal_encoder = OrdinalEncoder()
salary_data_encoded = ordinal_encoder.fit_transform(salary_data)

In [110]:
salary_data_encoded_output = pd.DataFrame(salary_data_encoded, columns=salary_data.columns, index=salary_data.index)

In [111]:
salary_data_encoded_output.head()

      salary
9838     1.0
7689     0.0
6557     2.0
6872     2.0
820      1.0

In [ ]:
numeric attributes  we need to do scaling